app/views/entities/new.html.erb

SELECT "groups"."name", "groups"."id" FROM "groups" WHERE "groups"."user_id" = $1 ORDER BY "groups"."name" ASC  [["user_id", 1]]
SELECT "entities"."name", "entities"."id" FROM "entities" WHERE "entities"."user_id" = $1 ORDER BY "entities"."name" ASC  [["user_id", 1]]
---
    <br/>
    <%= form.select :group_id, Entity.order(:name).where(user:current_user).pluck(:name, :id), {}, {:multiple => true, required:true, :id => "groups", :class => "form-select mb-3" } %>