app/views/entities/new.html.erb

    <%= form.label :group_id, 'Please select a category (ctrl+click for multiple selection):', class: "form-label" %><br/>
    <%= form.select :group_id, Group.order(:name).where(author:current_user).pluck(:name, :id), {}, {:multiple => true, required:true, :id => "groups", :class => "form-input" } %><br/>
---
SELECT "groups"."name", "groups"."id" FROM "groups" WHERE "groups"."author_id" = $1 ORDER BY "groups"."name" ASC  [["author_id", 1]]