app/views/groups/index.html.erb

SELECT "entities".* FROM "entities" WHERE "entities"."group_id" IN ($1, $2, $3, $4, $5, $6)  [["group_id", 1], ["group_id", 2], ["group_id", 3], ["group_id", 4], ["group_id", 5], ["group_id", 6]]
SELECT SUM("entities"."amount") FROM "entities" WHERE "entities"."group_id" = $1  [["group_id", 1]]
---
              </div>
              <p class="group-entity"> $ <%= group.entities.sum(:amount) %></p>