app/controllers/entities_controller.rb

INSERT INTO "entities" ("name", "amount", "author_id", "group_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Fiod"], ["amount", "3.0"], ["author_id", 1], ["group_id", 1], ["created_at", "2023-09-23 17:48:37.511418"], ["updated_at", "2023-09-23 17:48:37.511418"]]
---
  def create
    @groups = params[:entity][:group_id].drop(1)
    @groups.each do |category|
      @entity = Entity.new(name: params[:entity][:name], amount: params[:entity][:amount],
                           group_id: category.to_i, author_id: current_user.id)
      @entity.save