app/controllers/groups_controller.rb

    def index
        return unless current_user

        @user = current_user
        @groups = @user.groups.includes(:entities)
---
SELECT "entities".* FROM "entities" WHERE "entities"."group_id" IN ($1, $2)  [["group_id", 1], ["group_id", 2]]
SELECT "groups".* FROM "groups" WHERE "groups"."user_id" = $1  [["user_id", 1]]

    def show
        @group = Group.find(params[:id])
        @entities = @group.entities.order('created_at DESC')
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "entities".* FROM "entities" WHERE "entities"."group_id" = $1 ORDER BY created_at DESC  [["group_id", 4]]

    def create
        @group = Group.new(group_params)
        @group.user_id = current_user.id

        if @group.save
---
INSERT INTO "groups" ("name", "icon", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"